xiangjianhe/MonitorPro/code/Project/Header/TPV/PRJ_L_T2220_1A1D_INL_M215HNE_L30.h
//==================================================================
// Definitions of OOR Dclk Auto Adjust
//==================================================================
#define OOR_DCLK_CHECK                                  		_ON

//==================================================================
// Definitions of _VGA_CHROMA_PATTERN12_SUPPORT
//==================================================================
#define _VGA_CHROMA_PATTERN12_SUPPORT                           _ON

//==================================================================
// COLOR TEMP DEFAULT DATA
// Definitions Colortemp RGB value for each project
//==================================================================
#define _CT7200_LenovoPrj_RED                                   119
#define _CT7200_LenovoPrj_GREEN                                 125
#define _CT7200_LenovoPrj_BLUE                                  127

#define _CTSRGB_LenovoPrj_RED                                   126
#define _CTSRGB_LenovoPrj_GREEN                                 128
#define _CTSRGB_LenovoPrj_BLUE                                  125

#define _CT6500_LenovoPrj_RED                                   128
#define _CT6500_LenovoPrj_GREEN                                 128
#define _CT6500_LenovoPrj_BLUE                                  128

#define _CT9300_LenovoPrj_RED                                   105
#define _CT9300_LenovoPrj_GREEN                                 113
#define _CT9300_LenovoPrj_BLUE                                  128

#define _CTUSER_LenovoPrj_RED                                   128
#define _CTUSER_LenovoPrj_GREEN                                 128
#define _CTUSER_LenovoPrj_BLUE                                  128

#if(_LOW_BLUE_LIGHT_FUNCTION == _ON)

#define _CTLOWBLUELIGHT_RED                                     128 
#define _CTLOWBLUELIGHT_GREEN                                   128
#define _CTLOWBLUELIGHT_BLUE                                    100
#endif

//==================================================================
// Fine tuning OSD H position by pixel
//==================================================================
#define _OSD_POSITION_FONT_A_H_DELAY_                           1

//==================================================================
// Panel VCOM Function
//==================================================================
#define _PANEL_VCOM_ADJUST_FUNCTION						        _OFF

//-------------------------------------------------
//Definitions for panel backlight PWM ferq.
//-------------------------------------------------
#define _PWMFREQIVF                                             0
#define _PWMFREQ20K                                             1
#define _PWMFREQ22K												2

#define _BACKLIGHT_PWM_FREQ_SELECT                              _PWMFREQIVF//_PWMFREQ22K

//==================================================================
// Auot Power Down Function
//==================================================================
#define _AUTO_POWER_DOWN                                        _OFF

//----------------------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------------
// Lenovo Lenovo Lenovo Lenovo Lenovo Lenovo Lenovo Lenovo Lenovo Lenovo Lenovo Lenovo Lenovo Lenovo
//----------------------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------------
                                                
#endif // End of #if(_PROJECT == _PRJ_L_T2324P_AHP_LG_LM230WF3_SLN1)
